<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>  
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Bathory: Countess of Blood (2008)</h1>
    <!-- print original title -->
    <h3>Bathory</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="http://image.tmdb.org/t/p/w500/1Eo1i3SSWfwmYLhzwzySVZr3nqD.jpg" width="180px"/></div></td> -->
		
		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="images/Bathory - Countess of Blood (2008) h264-1080p AAC-2ch-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">Bathory is based on the legends surrounding the life and deeds of Countess Elizabeth Bathory known as the greatest murderess in the history of mankind. Contrary to popular belief, Elizabeth Bathory was a modern Renaissance woman who ultimately fell victim to mens aspirations for power and wealth.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Biography, Drama, Fantasy, History</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Juraj Jakubisko</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Juraj Jakubisko, John Paul Chapple, Lubom&iacute;r Feldek</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Erzs&eacute;bet B&aacute;thory - Anna Friel<br /> Thurzo - Karel Roden<br /> Ferenc Nadasdy - Vincent Regan<br /> Merisi Caravaggio - Hans Matheson<br /> Darvulia - Deana Horv&aacute;thov&aacute;<br /> King Mathias II - Franco Nero<br /> Pastor Ponicky - Antony Byrne<br /> Peter - Bolek Pol&iacute;vka<br /> Cyril - Jir&iacute; M&aacute;dl<br /> Countess Czobor - Monika Hilmerov&aacute;<br /> Lucia - Lucie Vondr&aacute;ckov&aacute;<br /> Mikl&oacute;s Zr&iacute;nyi - Jarom&iacute;r Nosek<br /> G&aacute;bor B&aacute;thory - Marek Majesk&yacute;<br /> Bethlen - Marek Vasut<br /> Dora - Jana Olhov&aacute;<br /> Erika - Michaela Drot&aacute;rov&aacute;<br /> S&aacute;ra - Sandra Pogodov&aacute;<br /> Ilona - Beata Greneche<br /> Beniczka - Eva Elsnerov&aacute;<br /> Margita - Hana Vagnerov&aacute;<br /> Village Mayor - Andrej Hryc<br /> Royal Guard Commander - Karel Dobr&yacute;<br /> Thurzo's Captain - Ren&eacute; St&uacute;r<br /> Zsigmond B&aacute;thory - Vincenzo Nicoli<br /> Ficzko - Karel Belohradsk&yacute;<br /> Footman Istv&aacute;n - Pavel Koc&iacute;<br /> Batth&aacute;nyi - Pavel Skr&iacute;pal<br /> P&aacute;l&iacute;fy - P&aacute;l Bocs&aacute;rszky<br /> Cardinal Forg&aacute;ch - Tim Preece<br /> Judge Sirmiensis - Jan Vlas&aacute;k<br /> Zavodsky - Petr Meissel<br /> Forenczy - Zdenek Maryska<br /> Tutor Imre Megyeri - Zdenek Podhursk&yacute;<br /> Landlady - Zuzana Frenglov&aacute;<br /> Orsolya Nadasdy - Tatjana Medveck&aacute;<br /> Count Druget - Jir&iacute; Hajdyla<br /> Monk - V&aacute;clav Krejc&iacute;<br /> Bald Hunchback - Petr J&aacute;kl<br /> Inn Keeper - Radek Hanac&iacute;k<br /> P&aacute;l - Derek Dimir<br /> Anna - Ester Honysov&aacute;<br /> Anna -4 years - Marie Bokov&aacute;<br /> Katalin - Katar&iacute;na I. Hanzelov&aacute;<br /> Katalin - the baby - Gracie Friel<br /> Erzs&eacute;bet - 9 years - Anicka Jurkov&aacute;<br /> Erzs&eacute;bet - 14 years - Katerina Petrovov&aacute;<br /> Ferenc - 18 years - Martin Cerca<br /> Cyril - 9 years - Pavel M&aacute;dl<br /> Castle Sarvar Warden - Vladim&iacute;r T. Gottwald<br /> Pals - Robbie Kay<br /> Chronicler - Jir&iacute; Korn<br /> Bandmaster - Jir&iacute; Krytin&aacute;r<br /> Young Ferenc N&aacute;dasdy - Ladislav Ondrej<br /> Muscular Man - Jir&iacute; Maria Sieber<br /> M&oacute;zes Czir&aacute;ky - Jan Unger</div></td>
      </tr>
    </table>
    
    <a href=../index.html>back...</a>
  </body>
    
</html>