<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html>
  <head>
    <style>  
      .poster{ }
      .plot{ vertical-align:top; }
      .genres{}
      .caption{font-weight:bold; vertical-align:top;}
    </style>
  </head>

  <body>
    <!-- print movie name and movie year -->
    <h1>Dead Snow 2: Red vs. Dead (2014)</h1>
    <!-- print original title -->
    <h3>D&oslash;d Sn&oslash; 2</h3>
    <br />
    <table>
      <tr>
        <!-- display movie poster (via url) or the image nopicture.gif if imageurl is empty -->
		<!-- <td><div class="poster"><img src="http://image.tmdb.org/t/p/w500/dLd6A24aHTTBZo8R7OAFzthr6h2.jpg" width="180px"/></div></td> -->
		
		<!-- display/copy movie poster from the local artworks or the image nopicture.gif if no poster is available -->
		<td><div class="poster"><img src="images/Dead Snow 2 - Red vs. Dead (2014) h264-1080p AAC-2ch-POSTER.thumb.jpg" width="180px"/></div></td>
        <td class="plot">The gruesome Nazi Zombies are back to finish their mission, but our hero is not willing to die. He is gathering his own army to give them a final fight.</td>
      </tr>
      <tr>
        <!-- print all genres -->
        <td class="caption">Genres:</td><td><div>Action, Comedy, Horror</div></td>
      </tr>
      <tr>
        <! -- print the director -->
        <td class="caption">Director:</td><td><div>Tommy Wirkola</div></td>
      </tr>
      <tr>
        <!-- print the writer -->
        <td class="caption">Writer:</td><td><div>Stig Frode Henriksen, Vegar Hoel, Tommy Wirkola</div></td>
      </tr>
        <!-- print all actors (their character and real name -->
        <td class="caption">Cast:</td><td><div>Martin - Vegar Hoel<br /> Herzog - &Oslash;rjan Gamst<br /> Daniel - Martin Starr<br /> Monica - Jocelyn DeBoer<br /> Blake - Ingrid Haas<br /> Glenn Kenneth - Stig Frode Henriksen<br /> Gunga - Hallvard Holmen<br /> Sidekick Zombie - Kristoffer Joner<br /> Reidun - Amrita Acharia<br /> Stavarin - Derek Mears<br /> Priest - Bjarte Tj&oslash;stheim<br /> Politiman - Christian Rubeck<br /> Hanna - Charlotte Frogner<br /> Nazi Doktor - Jesper Sundnes<br /> Zombie Navigat&oslash;r - Tage Guddingsmo<br /> Zombie Tanksj&aring;f&oslash;r - David Skaufjord<br /> Major Stubbe - Daniel Berge Halvorsen<br /> Eldre Dame Talvik - Gu&eth;mundur &Oacute;lafsson<br /> Doktor Brochman - Ingar Helge Gimle<br /> Bobby - Carl-Magnus Adner<br /> Tarm Zombie - Ivar Lykke<br /> Truck Driver - Lars Sundsb&oslash;<br /> Eldre Dame Talvik - Hanna Mar&iacute;a Karlsd&oacute;ttir<br /> Dame I Rullestol - Mar&iacute;a Gu&eth;mundsd&oacute;ttir<br /> Budbringer Fra WW2 - Vera Hilmarsd&oacute;ttir<br /> Eldre Mann - Kristian Figenschow<br /> Sykepleier - Laufey El&iacute;asd&oacute;ttir<br /> Mann Utenfor Museum - Seth Sharp<br /> Eldre Dame - J&oacute;hanna Axelsd&oacute;ttir<br /> Far - Epsen Edvardsen<br /> Ung Jente - &Aacute;lfr&uacute;n Laufeyjar-Sigur&eth;ard&oacute;ttir<br /> Politmann 2 - Thorir S&aelig;mundsson<br /> Barn Utenfor Talvik - J&oacute;n Sk&uacute;li Gu&eth;mundsson<br /> Barn Utenfor Talvik - Aron Valgeirsson<br /> Barn Utenfor Talvik - Sindri Freyr Seim Sigur&eth;sson<br /> Pappa - Espen Edvartsen<br /> SS Zombie / Nazi Zombie - Tommi Thor Gudmundsson<br /> Police Officer - Halld&oacute;r Magn&uacute;sson</div></td>
      </tr>
    </table>
    
    <a href=../index.html>back...</a>
  </body>
    
</html>